#+TITLE: Jeffs notes on zsh
#+STARTUP: showall

** SH_WORD_SPLIT

   by default, zsh will not split the expansion of a multi word parameter on spaces as sh does
   because it treats it as an array
   but this shows that there are other places where expansion happens

   to split an arg by spaces, use ~${=foo}~

   #+begin_src shell :results output verbatim
     zsh -s <<'eos'
     function show_args() {
       echo num args: $#
       echo $@
     }

     foo=(every good boy does fine)
     show_args $foo
     show_args "$foo"
     show_args ${foo[3]} $foo[5]
     eos
   #+end_src

   #+RESULTS:
   : num args: 5
   : every good boy does fine
   : num args: 1
   : every good boy does fine
   : num args: 2
   : boy fine

** redirection

   if the word behind a redirection symbol (eg ~<~) expands to multiple words, each of them is treated as a
   file and they are opened one by one to provide the input

   #+begin_src shell :results output replace
     zsh -s <<'eos'
     echo every >! /tmp/one; echo good >! /tmp/two; files=(/tmp/{one,two}); cat -n <${files}; rm ${files};
     eos
   #+end_src

   #+RESULTS:

   the same effect can be had when multios are in effect without the use of an array:

   #+begin_src shell :results output replace
     zsh -s <<'eos'
     setopt MULTIOS
     echo every >! /tmp/one; echo good >! /tmp/two; cat -n < /tmp/one < /tmp/two; rm /tmp/{one,two};
     eos
   #+end_src

   #+RESULTS:
   :      1	every
   :      2	good

** arithmetic operations

   zsh can natively show thousands, millions separators -- like my commify -- using an output base specifier. eg

   #+begin_src shell :results output replace
     zsh <<-'eos'
     print $(( [#_] 178316242 ))
     eos
   #+END_SRC

   #+RESULTS:
   : 178_316_242

   this, of course, works with all of the bases (2 - 36) that zsh supports

   #+begin_src shell :results output replace
     zsh <<-'eos'
     setopt cbases
     print $(( [#16_4] 65536 ** 2 ))
     eos
   #+END_SRC

   #+RESULTS:
   : 0x1_0000_0000

   another example:

   #+begin_src shell :results output replace
     zsh <<-'eos'
     print $(( [#_] 178316242 ))
     eos
   #+END_SRC

   #+RESULTS:
   : 178_316_242

   > An arithmetic expression uses nearly the same syntax and associativity of expressions as in C.

   in particular ~++~, ~--~ and all the bitwise operators are supported.
   the ternary operator is supported, as well as the comma operator.

   > the operators ~&&~, ~||~, ~&&=~ and ~||=~ are short circuiting, and only one of the two of the latter
   expressions in a ternary operator is evaluated.

*** reverse a string
    #+begin_src shell :results output
      #!/usr/bin/env zsh -norcs

      function rev () {
          declare -a out
          while (( $# > 0 )); do
              # split $1 on character boundaries
              declare -a source=(${(ps..)1})
              shift
              declare -a result=()
              while (( $#source > 0 )); do
                  result+=($source[-1])
                  shift -p source
              done;
              # join the result array back down to a string
              out+=(${(j::)result})
          done
          print $out

          return 0
      }

      function show_rev() {
          print "$#:" $@
          print '>>' $(rev $@)
      }
      declare -a egbdf=(every good boy does fine)
      show_rev $egbdf
      show_rev "$egbdf"
      declare -a racing_emoji=(racing_car_🏎 racing_motorcycle_🏍 horse_racing_🏇)
      show_rev $racing_emoji
      show_rev "$racing_emoji"
      # the empty string
      show_rev
    #+end_src

    #+RESULTS:
    #+begin_example
    5: every good boy does fine
    >> yreve doog yob seod enif
    1: every good boy does fine
    >> enif seod yob doog yreve
    3: racing_car_🏎 racing_motorcycle_🏍 horse_racing_🏇
    >> 🏎_rac_gnicar 🏍_elcycrotom_gnicar 🏇_gnicar_esroh
    1: racing_car_🏎 racing_motorcycle_🏍 horse_racing_🏇
    >> 🏇_gnicar_esroh 🏍_elcycrotom_gnicar 🏎_rac_gnicar
    0:
    >>
    #+end_example

*** remove vowels from a string
    #+begin_src shell :results output
      #!/usr/bin/env zsh -norcs

      function remove_vowels() {
          declare -A vowels=(a 1 e 1 i 1 o 1 u 1)
          declare -a out
          while (( $# > 0 )); do
              # split $1 on character boundaries
              declare -a source=(${(ps..)1})
              shift
              declare -a result=()
              while (( $#source > 0 )); do
                  # is this char in the zsh vowels associative array?
                  if (( ${+vowels[$source[1]]} )); then
                      ;
                  else
                      result+=($source[1])
                  fi
                  shift source
              done
              # join the result back down into a string
              out+=(${(j::)result})
          done
          print $out
          return 0
      }

      declare -a egbdf=(every good boy does fine)
      remove_vowels $egbdf
    #+end_src

    #+RESULTS:
    : vry gd by ds fn

